[
  {
    "title": "Plateforme E-commerce",
    "slug": "ecommerce-platform",
    "shortDescription": "Une boutique en ligne complète avec traitement des paiements",
    "description": "Une plateforme e-commerce moderne construite avec Next.js et Stripe, comprenant des listes de produits, un panier d'achat, une authentification utilisateur et un traitement des paiements. La plateforme inclut un tableau de bord administrateur pour gérer les produits, les commandes et les clients.\n\nLe frontend est construit avec Next.js et Tailwind CSS, offrant une interface utilisateur responsive et accessible. Le backend utilise les routes API de Next.js et Prisma pour les opérations de base de données, avec une intégration Stripe pour le traitement des paiements.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": ["Next.js", "React", "TypeScript", "Tailwind CSS", "Prisma", "PostgreSQL", "Stripe"],
    "timeline": "3 mois (Jan 2023 - Mar 2023)",
    "liveUrl": "https://example-ecommerce.vercel.app",
    "githubUrl": "https://github.com/username/ecommerce-platform",
    "personalExperience": "La construction de cette plateforme e-commerce a été une expérience difficile mais enrichissante. J'ai beaucoup appris sur l'intégration des systèmes de traitement des paiements et la gestion d'états complexes dans une grande application.\n\nL'aspect le plus difficile a été l'implémentation de la fonctionnalité du panier d'achat à travers différentes pages et la garantie de la cohérence des données. J'ai résolu ce problème en utilisant l'API Context de React et le stockage local pour la persistance.\n\nJe suis particulièrement fier des optimisations de performance que j'ai implémentées, résultant en un score Lighthouse de plus de 95 dans toutes les catégories.",
    "collaborators": []
  },
  {
    "title": "Application de Gestion de Tâches",
    "slug": "task-management-app",
    "shortDescription": "Une application collaborative de gestion de tâches",
    "description": "Une application collaborative de gestion de tâches qui aide les équipes à organiser et suivre leur travail. L'application comprend la création de tâches, l'attribution, les dates d'échéance, les commentaires, les pièces jointes et les mises à jour en temps réel.\n\nLes utilisateurs peuvent créer des projets, inviter des membres de l'équipe et organiser les tâches en listes ou en tableaux. L'application comprend également des fonctionnalités de reporting pour suivre la productivité et l'avancement du projet.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": ["React", "Node.js", "Express", "MongoDB", "Socket.io", "Docker"],
    "timeline": "4 mois (Mai 2022 - Août 2022)",
    "liveUrl": "https://task-app-demo.vercel.app",
    "githubUrl": "https://github.com/username/task-management-app",
    "personalExperience": "Ce projet a été ma première expérience de construction d'une application collaborative en temps réel. L'implémentation de WebSockets pour les mises à jour en temps réel était à la fois difficile et fascinante.\n\nJ'ai beaucoup appris sur la synchronisation d'état entre plusieurs clients et la gestion des conditions de course. Le projet a également amélioré mes compétences en conception de schémas de base de données pour des relations complexes entre entités.\n\nTravailler avec une équipe sur ce projet m'a enseigné des leçons précieuses sur l'organisation du code, la documentation et les flux de travail collaboratifs.",
    "collaborators": ["Jane Doe - Développeur Backend", "John Smith - Designer UI/UX"]
  },
  {
    "title": "Tableau de Bord Météo",
    "slug": "weather-dashboard",
    "shortDescription": "Une application de prévisions météorologiques avec cartes interactives",
    "description": "Une application de prévisions météorologiques qui fournit les conditions météorologiques actuelles et des prévisions pour des emplacements dans le monde entier. L'application comprend des cartes interactives, des graphiques pour la température et les précipitations, et des alertes météorologiques sévères.\n\nLes utilisateurs peuvent rechercher des emplacements, enregistrer des favoris et consulter des informations météorologiques détaillées, notamment la température, l'humidité, la vitesse du vent et l'indice UV. L'application fournit également des prévisions horaires pour les 48 prochaines heures et des prévisions quotidiennes pour les 7 prochains jours.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": ["React", "TypeScript", "Chart.js", "Mapbox", "API OpenWeather", "Tailwind CSS"],
    "timeline": "1 mois (Nov 2021)",
    "liveUrl": "https://weather-dash.vercel.app",
    "githubUrl": "https://github.com/username/weather-dashboard",
    "personalExperience": "La création de ce tableau de bord météo a été une excellente occasion de travailler avec des API externes et des bibliothèques de visualisation de données. J'ai apprécié le défi de présenter des données météorologiques complexes dans une interface conviviale.\n\nLa partie la plus intéressante a été l'implémentation des cartes interactives avec des superpositions météorologiques. J'ai beaucoup appris sur les données géospatiales et les projections cartographiques.\n\nCe projet m'a également aidé à améliorer mes compétences en conception responsive, en veillant à ce que le tableau de bord fonctionne bien sur les ordinateurs de bureau et les appareils mobiles.",
    "collaborators": []
  },
  {
    "title": "Blog Personnel",
    "slug": "personal-blog",
    "shortDescription": "Un blog statique construit avec Next.js et MDX",
    "description": "Un blog personnel construit avec Next.js et MDX, présentant des articles sur le développement web, la programmation et la technologie. Le blog comprend des catégories, des tags, une fonctionnalité de recherche et un abonnement à la newsletter.\n\nLe site est généré statiquement pour des performances et un référencement optimaux. Le contenu est rédigé en MDX, permettant des composants interactifs riches dans les articles de blog.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": ["Next.js", "MDX", "Tailwind CSS", "Vercel", "React"],
    "timeline": "2 semaines (Avr 2021)",
    "liveUrl": "https://dev-blog-example.vercel.app",
    "githubUrl": "https://github.com/username/personal-blog",
    "personalExperience": "La création de ce blog a été un projet amusant pour explorer la génération de sites statiques avec Next.js et la gestion de contenu avec MDX. Je voulais une plateforme pour partager mes connaissances et expériences en développement web.\n\nJ'ai particulièrement apprécié la conception de la typographie et de l'expérience de lecture, en me concentrant sur la lisibilité et l'accessibilité. Le projet m'a aidé à comprendre l'importance de l'optimisation des performances pour les sites web riches en contenu.\n\nLe blog continue d'être une plateforme pour documenter mon parcours d'apprentissage et partager des idées avec la communauté des développeurs.",
    "collaborators": []
  },
  {
    "title": "Suivi de Fitness",
    "slug": "fitness-tracker",
    "shortDescription": "Une application web mobile-first pour suivre les entraînements et la nutrition",
    "description": "Une application de suivi de fitness qui aide les utilisateurs à surveiller leurs entraînements, leur nutrition et leurs progrès vers des objectifs de fitness. L'application permet aux utilisateurs de créer des routines d'entraînement personnalisées, d'enregistrer des exercices, de suivre les calories et les macronutriments, et de visualiser les progrès au fil du temps.\n\nL'application comprend une bibliothèque d'entraînements avec des vidéos d'instruction, une base de données nutritionnelle, un suivi des mesures corporelles et la définition d'objectifs. Les utilisateurs peuvent également partager leurs réalisations sur les réseaux sociaux et participer à des défis.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": ["React Native Web", "Firebase", "Redux", "D3.js", "Progressive Web App"],
    "timeline": "5 mois (Juin 2021 - Oct 2021)",
    "liveUrl": "https://fitness-tracker-pwa.vercel.app",
    "githubUrl": "https://github.com/username/fitness-tracker",
    "personalExperience": "Le développement de ce suivi de fitness a été motivé par mon intérêt personnel pour le fitness et la santé. Je voulais créer un outil que j'utiliserais moi-même.\n\nL'aspect le plus difficile a été la conception de la structure de données pour stocker et interroger efficacement les données d'entraînement et de nutrition. J'ai passé un temps considérable à rechercher des méthodologies de suivi de fitness pour m'assurer que l'application serait utile pour différents types d'entraînements et de régimes alimentaires.\n\nL'implémentation des graphiques de visualisation des progrès a été particulièrement gratifiante, car elle nécessitait de transformer des données complexes en représentations visuelles intuitives qui aident les utilisateurs à comprendre leurs progrès d'un coup d'œil.",
    "collaborators": ["Alex Johnson - Chercheur UX", "Sam Williams - Consultant Fitness"]
  },
  {
    "title": "Site Web Portfolio",
    "slug": "portfolio-website",
    "shortDescription": "Un site web portfolio personnel présentant mon travail",
    "description": "Un site web portfolio personnel construit avec Next.js et Tailwind CSS, présentant mes compétences, expériences et projets. Le site présente un design propre et moderne inspiré de l'esthétique de Vercel, avec des animations fluides et des mises en page responsives.\n\nLe site web comprend des sections pour les compétences, les expériences et les projets, avec des pages détaillées pour chaque élément. Le contenu est géré via des fichiers JSON, ce qui facilite la mise à jour sans modifier le code.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "Framer Motion", "Vercel"],
    "timeline": "3 semaines (Mai 2023)",
    "liveUrl": "https://portfolio-example.vercel.app",
    "githubUrl": "https://github.com/username/portfolio-website",
    "personalExperience": "La création de mon site web portfolio a été l'occasion de présenter non seulement mes projets, mais aussi ma sensibilité au design et mon attention aux détails. Je voulais un site propre et professionnel qui mettrait efficacement en valeur mon travail.\n\nJe me suis concentré sur la création d'une expérience utilisateur fluide avec des animations et des transitions subtiles. Le projet m'a aidé à affiner mes compétences en conception responsive et en accessibilité.\n\nLa partie la plus agréable a été l'implémentation du toggle de mode sombre qui respecte les préférences système de l'utilisateur tout en permettant une substitution manuelle.",
    "collaborators": []
  }
]
